Австралия/src/Catalogs/Peripherals/Peripherals.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Peripherals</name>
  <attributes>
    <name>EquipmentType</name>
    <type>
      <types>EnumRef.PeripheralTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>DeviceIdentifier</name>
    <comment>Unique identifier of hardware standard device</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DeviceDisconnected</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>DeviceIsInUse</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>HardwareDriver</name>
    <type>
      <types>CatalogRef.HardwareDrivers</types>
    </type>
  </attributes>
  <attributes>
    <name>Parameters</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Workplace</name>
    <type>
      <types>CatalogRef.Workplaces</types>
    </type>
  </attributes>
  <attributes>
    <name>ReinstallationRequired</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>InstallationIsRequired</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ExchangeRule</name>
    <comment>Intended for exchange with offline equipment</comment>
    <type>
      <types>CatalogRef.ExchangeWithOfflinePeripheralsRules</types>
    </type>
  </attributes>
  <attributes>
    <name>InfobaseNode</name>
    <comment>Intended for exchange with offline equipment</comment>
    <type>
      <types>ExchangePlanRef.ExchangeWithOfflinePeripherals</types>
    </type>
  </attributes>
  <attributes>
    <name>SerialNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ComponentVersion</name>
    <comment>Component Version</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Австралия/src/Catalogs/Peripherals/ObjectModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region EventsHandlers

// Procedure performs the device parameter initialization.
//
Procedure BeforeWrite(Cancel)
	
	If DataExchange.Load Then
		Return;
	EndIf;
	
	If IsNew() Then
		Parameters = New ValueStorage(New Structure());
	EndIf;
	
EndProcedure

// Procedure checks the catalog
// item description uniqueness for this computer.
Procedure FillCheckProcessing(Cancel, CheckedAttributes)

	If Not IsBlankString(Description) Then
		Query = New Query("
		|SELECT
		|    1
		|FROM
		|    Catalog.Peripherals AS Peripherals
		|WHERE
		|    Peripherals.Description = &Description
		|    AND Peripherals.Workplace = &Workplace
		|    AND Peripherals.Ref <> &Ref
		|");

		Query.SetParameter("Description", Description);
		Query.SetParameter("Workplace", Workplace);
		Query.SetParameter("Ref"      , Ref);

		If Not Query.Execute().IsEmpty() Then
			CommonClientServer.MessageToUser(NStr("en = 'Non-unique item name specified. Specify a unique name.'; ru = 'Указано неуникальное наименование элемента. Укажите уникальное наименование.';pl = 'Podano nie unikalną nazwę przedmiotu. Podaj unikalną nazwę.';es_ES = 'Nombre del artículo no único especificado. Especificar un nombre único.';es_CO = 'Nombre del artículo no único especificado. Especificar un nombre único.';tr = 'Benzersiz olmayan öğe adı belirtildi. Benzersiz bir ad belirtin.';it = 'Nome dell''elemento non univoco specificato. Specificare un nome univoco.';de = 'Nicht eindeutiger Elementname angegeben. Geben Sie einen eindeutigen Namen an.'"), ThisObject, , , Cancel);
		EndIf;
	EndIf;

EndProcedure

// Procedure performs attribute cleaning which shouldn't be copied.
// The following attributes are cleared when you copy:
// "Parameters"    - device parameters are reset to Undefined;
// "Description"   - other than the original description is set;
Procedure OnCopy(CopiedObject)
	
	DeviceIsInUse = True;
	Parameters = Undefined;

	Description = NStr("en = '%Description% (copy)'; ru = '%Description% (копия)';pl = '%Description% (kopiuj)';es_ES = '%Description% (copia)';es_CO = '%Description% (copia)';tr = '%Description% (kopya)';it = '%Description% (copia)';de = '%Description% (Kopie)'");
	Description = StrReplace(Description, "%Description%", CopiedObject.Description);
	
EndProcedure

// On write
//
Procedure OnWrite(Cancel)
	
	If DataExchange.Load Then
		Return;
	EndIf;

EndProcedure

#EndRegion

#EndIf
